<?php
#--------------[ text section users ]--------------#
$textbotlang =[];
$textbotlang['users']['channel']['link'] = "Не установлено";
$textbotlang['users']['channel']['text_join'] = "🔗 Присоединиться к каналу";
$textbotlang['users']['channel']['confirmjoin'] = "✅ Проверить подписку";
$textbotlang['users']['channel']['confirmed'] = "Ваша подписка успешно подтверждена, спасибо вам ❤️";
$textbotlang['users']['channel']['notconfirmed'] = "❌ Вы еще не подписались на канал.";

$textbotlang['users']['Rules'] = "✅ Правила подтверждены, теперь вы можете пользоваться услугами бота.";
$textbotlang['users']['Rulesbtn'] = "♨️ Раздел правил";
$textbotlang['users']['maangeuser'] = "👤 Кнопка имени пользователя";
$textbotlang['users']['RulesDescription'] = "♨️ Правила использования наших услуг

1- Обязательно обращайте внимание на объявления, публикуемые в канале.
2- Если в канале нет объявления о перебоях в работе, обратитесь в службу поддержки.
3- Не отправляйте услуги через SMS, для этого вы можете использовать email.";
$textbotlang['users']['fqDescription'] = " 
 💡 Часто задаваемые вопросы ⁉️

1️⃣ Ваш VPN имеет фиксированный IP? Можно ли использовать для криптовалютных бирж?

✅ Из-за состояния сети и ограничений в стране наш сервис не подходит для трейдинга, только с фиксированным локацией.

2️⃣ Если я продлю аккаунт до истечения срока, сгорят ли оставшиеся дни?

✅ Нет, оставшиеся дни аккаунта учитываются при продлении. Например, если вы продлите месячный аккаунт за 5 дней до истечения, добавится 5 оставшихся дней + 30 дней продления.

3️⃣ Что произойдет, если подключиться к одному аккаунту больше разрешенного лимита?

✅ В этом случае ваш трафик закончится быстрее.

4️⃣ Какой тип VPN у вас?

✅ Наши VPN работают на v2ray и поддерживают различные протоколы, чтобы вы могли пользоваться сервисом без проблем даже при нестабильном интернете.

5️⃣ Из какой страны ваш VPN?

✅ Наш VPN-сервер находится в Германии.

6️⃣ Как использовать этот VPN?

✅ Для инструкции по использованию нажмите кнопку «📚 Обучение».

7️⃣ VPN не подключается, что делать?

✅ Обратитесь в поддержку с скриншотом ошибки, которую вы получаете.

8️⃣ Ваш VPN гарантирует постоянное подключение?

✅ Из-за непредсказуемости состояния интернета в стране мы не можем гарантировать это, но мы прилагаем все усилия для предоставления лучшего сервиса.

9️⃣ Возможен ли возврат средств?

✅ Возврат возможен, если проблема не решена с нашей стороны.

💡 Если вы не нашли ответ на свой вопрос, обратитесь в «поддержку».";
$textbotlang['users']['fqbtn'] = "❓ Частые вопросы";
$textbotlang['users']['channeldosntjoin'] = "   
        ⚠️ Уважаемый пользователь, вы не подписаны на наш канал.
Нажмите кнопку ниже, чтобы присоединиться к каналу.
После подписки нажмите кнопку проверки подписки.";
$textbotlang['users']['back'] = "Вы вернулись на главную страницу!";
$textbotlang['users']['backorder'] = "🏠 Назад к информации о сервисе";
$textbotlang['users']['spamtext'] = "Спам в боте";
$textbotlang['users']['online'] = "Онлайн";
$textbotlang['users']['offline'] = "Офлайн";
$textbotlang['users']['unlimited'] = "Безлимит";
$textbotlang['users']['start'] = "Привет, добро пожаловать 🌹";
$textbotlang['users']['sendmessagesupport'] = "🎟 Отправить сообщение в поддержку";

$textbotlang['users']['number']['false'] = "❌ Номер телефона неверный. Отправьте правильный номер телефона.";
$textbotlang['users']['number']['Warning'] = "⚠️ Ошибка сохранения номера телефона, номер должен принадлежать этому аккаунту";
$textbotlang['users']['number']['erroriran'] = "⭕️ Номер мобильного телефона недействителен. Принимаются только иранские номера";
$textbotlang['users']['number']['active'] = "✅ Ваш номер мобильного телефона успешно подтвержден";
$textbotlang['users']['number']['Confirming'] = "📞 Пожалуйста, отправьте свой номер мобильного телефона для аутентификации";

$textbotlang['users']['sell']['service_not_available'] = "⛔️ У вас нет активных сервисов";
$textbotlang['users']['sell']['service_sell'] = "🛍 Купленные подписки
    ⚜️Нажмите на имя пользователя, чтобы просмотреть информацию";
$textbotlang['users']['sell']['Service-select'] = "🛒 Локация получена, выберите сервис, который хотите приобрести.";
$textbotlang['users']['sell']['Service-Location'] = "❌ Ошибка 
        📝 Неверная локация сервиса";
$textbotlang['users']['sell']['error-product'] = "❌ Ошибка 
        📝 Выбранный продукт не существует";
$textbotlang['users']['sell']['None-credit'] = "🚨 Произошла ошибка при оплате.
📝 Причина: Недостаточно средств на вашем счете. Пожалуйста, пополните баланс.

❌ Для пополнения баланса выберите один из способов оплаты ниже";
$textbotlang['users']['sell']['ErrorConfig'] = "❌ Ошибка при создании подписки. Обратитесь в поддержку для устранения проблемы.";
$textbotlang['users']['sell']['selectpayment'] = "📌 Выберите способ оплаты из списка выше";

$textbotlang['users']['stateus']['notUsername'] = "⭕️ Уважаемый пользователь, если вашего имени пользователя нет в списке выше, нажмите кнопку ниже.";
$textbotlang['users']['stateus']['notUsernameget'] = "Имя пользователя не найдено";
$textbotlang['users']['stateus']['SendUsername'] = "Отправьте ваше имя пользователя";
$textbotlang['users']['stateus']['active'] = "✅ Активен";
$textbotlang['users']['stateus']['limited'] = "🚫 Лимит трафика";
$textbotlang['users']['stateus']['onhold'] = "⏳ Не подключен";
$textbotlang['users']['stateus']['disabled'] = "❌ Неактивен";
$textbotlang['users']['stateus']['expired'] = "🔚 Срок действия истек";
$textbotlang['users']['stateus']['Unlimited'] = "Безлимит";
$textbotlang['users']['stateus']['day'] = "день";
$textbotlang['users']['stateus']['Notconsumed'] = "Не использовано";
$textbotlang['users']['stateus']['username'] = "Имя пользователя: ";
$textbotlang['users']['stateus']['stateus'] = "Статус:";
$textbotlang['users']['stateus']['expirationDate'] = "Дата окончания:";
$textbotlang['users']['stateus']['daysleft'] = "Осталось дней:";
$textbotlang['users']['stateus']['usedTrafficGb'] = "Использованный трафик:";
$textbotlang['users']['stateus']['LastTraffic'] = "Общий трафик:";
$textbotlang['users']['stateus']['RemainingVolume'] = "Остаток трафика:";
$textbotlang['users']['stateus']['info'] = "📊 Информация о сервисе:";
$textbotlang['users']['stateus']['error'] = "❌Произошла ошибка";
$textbotlang['users']['stateus']['usernotfound'] = " ❌ Пользователь не найден на сервере";
$textbotlang['users']['stateus']['getlinksub'] = "🔗 Получить ссылку на подписку";
$textbotlang['users']['stateus']['linksub'] = "🔗 Ссылка на подписку";
$textbotlang['users']['stateus']['backlist'] = "🏠 Назад к списку сервисов";
$textbotlang['users']['stateus']['backservice'] = "🏠 Назад к деталям сервиса";
$textbotlang['users']['stateus']['Invalidusername'] = "❌ Неверное имя пользователя.
🔄 Пожалуйста, отправьте ваше имя пользователя снова";
$textbotlang['users']['stateus']['manageService'] = "⚙️ Настройки сервиса";
$textbotlang['users']['stateus']['manageServicedec'] = "📌 Для настройки сервиса создайте конфиг в панели и активируйте сервисы, которые хотите использовать, затем отправьте имя пользователя конфига.";
$textbotlang['users']['stateus']['DecManageService '] = "⭕️ В этом разделе вы можете управлять своим сервисом";
$textbotlang['users']['stateus']['config'] ="🔰 Ручной конфиг";
$textbotlang['users']['stateus']['notconnected'] ="Не подключен";

$textbotlang['users']['extend']['title'] ="💊 Продление сервиса";
$textbotlang['users']['extend']['confirm'] = "Подтвердить продление";
$textbotlang['users']['extend']['thanks'] = "Спасибо за продление вашего сервиса 🙏

⭕️ Ваше продление успешно выполнено, спасибо за оплату.
 
⬅️ Для возврата к списку ваших сервисов или просмотра информации нажмите кнопки ниже";
$textbotlang['users']['extend']['error'] = "❌ Произошла ошибка, обратитесь в поддержку";
$textbotlang['users']['extend']['selectservice'] = " 🛍 Выберите продукт для продления";
$textbotlang['users']['extend']['invoicExtend'] = "🧾 Ваш счет на продление для имени пользователя %s создан.
            
🛍 Название продукта:  %s
Сумма продления:  %s
Срок продления: %s дней
Трафик продления: %s ГБ
            
✅ Для подтверждения и продления сервиса нажмите кнопку ниже
            
❌ Для продления необходимо пополнить ваш кошелек.";

$textbotlang['users']['buy']['errorInCreate'] = "Ошибка при создании конфига
✍️ Причина ошибки: 
%s
ID пользователя: %s
Имя пользователя: @%s";
$textbotlang['users']['buy']['createservicetest'] = "✅ Сервис успешно создан
    
👤 Имя пользователя сервиса: <code>%s</code>
🌿 Название сервиса: Тест
‏🇺🇳 Локация: %s
⏳ Срок действия: %s часов
🗜 Трафик сервиса:  %s МБ
    
Ссылка для подключения:
<code>%s</code>
<code>%s</code>
    
📚 Инструкцию по подключению к сервису можно изучить, нажав кнопку ниже";
$textbotlang['users']['buy']['createservicewg'] = "✅ Сервис успешно создан
    
👤 Имя пользователя сервиса: <code>%s</code>
🌿 Название сервиса: Тест
‏🇺🇳 Локация: %s
⏳ Срок действия: %s часов
🗜 Трафик сервиса:  %s МБ
    
📚 Инструкцию по подключению к сервису можно изучить, нажав кнопку ниже";
$textbotlang['users']['buy']['createservicewgbuy'] = "✅ Сервис успешно создан
    
👤 Имя пользователя сервиса: <code>%s</code>
🌿 Название сервиса: %s
‏🇺🇳 Локация: %s
⏳ Срок действия: %s дней
🗜 Трафик сервиса:  %s ГБ
    
📚 Инструкцию по подключению к сервису можно изучить, нажав кнопку ниже";
$textbotlang['users']['buy']['createservice'] = "✅ Сервис успешно создан
    
👤 Имя пользователя сервиса: <code>%s</code>
🌿 Название сервиса: %s
‏🇺🇳 Локация: %s
⏳ Срок действия: %s дней
🗜 Трафик сервиса:  %s ГБ
    
Ссылка для подключения:
<code>%s</code>
<code>%s</code>
    
📚 Инструкцию по подключению к сервису можно изучить, нажав кнопку ниже";
$textbotlang['users']['buy']['selectService'] = "🛍 Для покупки подписки выберите желаемый сервис
Локация сервиса: %s";
$textbotlang['users']['buy']['invoicebuy'] = "📇 Ваш предварительный счет:
👤 Имя пользователя: <code>%s</code>
🔐 Название сервиса: %s
📆 Срок действия: %s дней
💶 Цена: %s томанов
👥 Объем аккаунта: %s ГБ
💵 Баланс вашего кошелька: %s
    
💰 Ваш заказ готов к оплате.  ";
$textbotlang['users']['buy']['payandGet'] = "💰 Оплатить и получить сервис";
$textbotlang['users']['buy']['discount'] = "🎁 Ввести промокод";
$textbotlang['users']['buy']['configwg'] = "⚙️ Ваш конфиг";

$textbotlang['users']['category']['NotFound'] = "❌ Категория не найдена.";
$textbotlang['users']['category']['selectCategory'] = "📌 Выберите нужную категорию.";
$textbotlang['users']['category']['error'] = "❌ Произошла ошибка, пожалуйста, начните процесс покупки заново.";

$textbotlang['users']['changetext']['set_start_text'] = "Настроить приветственный текст";
$textbotlang['users']['changetext']['purchased_service_button'] = "Кнопка купленных сервисов";
$textbotlang['users']['changetext']['test_account_button'] = "Кнопка тестового аккаунта";
$textbotlang['users']['changetext']['faq_button'] = "Кнопка частых вопросов";
$textbotlang['users']['changetext']['tutorial_button'] = "Текст кнопки 📚 Обучение";
$textbotlang['users']['changetext']['support_button'] = "Текст кнопки ☎️ Поддержка";
$textbotlang['users']['changetext']['increase_balance_button'] = "Кнопка пополнения баланса";
$textbotlang['users']['changetext']['law_text'] = "⚖️ Текст правил";
$textbotlang['users']['changetext']['buy_subscription_button'] = "Текст кнопки покупки подписки";
$textbotlang['users']['changetext']['tariff_list_button'] = "Текст кнопки списка тарифов";
$textbotlang['users']['changetext']['tariff_list_description'] = "Текст описания списка тарифов";
$textbotlang['users']['changetext']['user_account_button'] = "Текст кнопки аккаунта пользователя";
$textbotlang['users']['changetext']['mandatory_membership_description'] = "📝 Настроить текст обязательной подписки";
$textbotlang['users']['changetext']['faq_description'] = "📝 Настроить текст частых вопросов";

$textbotlang['users']['Extra_volume']['SetPrice'] = "⭕️ Укажите цену за каждый дополнительный ГБ трафика.
Текущая цена:";
$textbotlang['users']['Extra_volume']['ChangedPrice'] = "✅ Цена успешно сохранена.";
$textbotlang['users']['Extra_volume']['sellextra'] = "➕ Покупка дополнительного трафика";
$textbotlang['users']['Extra_volume']['extraadded'] = "✅ Трафик успешно добавлен к вашему сервису.";
$textbotlang['users']['Extra_volume']['extracheck'] = "Подтвердить и получить дополнительный трафик";
$textbotlang['users']['Extra_volume']['invalidprice'] = "Минимальный объем 1 ГБ";
$textbotlang['users']['Extra_volume']['VolumeValue'] = "⭕️ Укажите количество трафика, которое хотите приобрести.
    
⚠️ Цена за каждый дополнительный ГБ: %s";
$textbotlang['users']['Extra_volume']['invoiceExtraVolume'] = "📇 Счет на покупку дополнительного трафика создан.
    
💰 Цена за ГБ:  %s томанов
📝 Сумма счета:  %s томанов
📥 Запрашиваемый трафик: %s ГБ

✅ Для оплаты и добавления трафика нажмите кнопку ниже.";

$textbotlang['users']['usertest']['limitwarning'] = "⚠️ Вы исчерпали лимит на создание тестовых аккаунтов.";
$textbotlang['users']['usertest']['errorcreat'] = "❌ Ошибка при создании тестового аккаунта, обратитесь в поддержку.";
$textbotlang['users']['usertest']['iduser'] = "ID пользователя";
$textbotlang['users']['usertest']['phonenumber'] = "Номер телефона пользователя";
$textbotlang['users']['usertest']['namepanel'] = "Название панели";
$textbotlang['users']['usertest']['usertestbtn'] = "🔑 Тестовый аккаунт";

$textbotlang['users']['help']['title'] = "📚 Обучение";
$textbotlang['users']['help']['disablehelp'] = "Раздел обучения временно недоступен. 😔";
$textbotlang['users']['help']['btninlinebuy'] = "📚 Посмотреть инструкцию";

$textbotlang['users']['support']['title'] = "☎️ Поддержка";
$textbotlang['users']['support']['sendmessageadmin'] = "🚀 Ваше сообщение отправлено, ожидайте ответа администратора";
$textbotlang['users']['support']['answermessage'] = "Ответить на сообщение";
$textbotlang['users']['support']['sendmessageuser'] = "📨 Отправьте ваше сообщение в поддержку";
$textbotlang['users']['support']['btnsupport'] = "☎️ В разделе «Частые вопросы» ниже собраны ответы на популярные вопросы. Если вы не нашли ответа, нажмите кнопку поддержки.";
$textbotlang['users']['support']['GetMessageOfUser'] = "📥 Получено сообщение от пользователя. Для ответа нажмите кнопку ниже и отправьте ваше сообщение
ID пользователя: %s
Имя пользователя: @%s
📝 Текст сообщения: %s";

$textbotlang['users']['Balance']['priceinput'] = "💸 Введите сумму в томанах:
✅ Максимальная сумма 10,000,000 томанов";
$textbotlang['users']['Balance']['errorprice'] = "❌ Ошибка 
💬 Пожалуйста, вводите только цифры
Цифры должны быть на латинице (английская раскладка)";
$textbotlang['users']['Balance']['errorpricelimit'] = "❌ Ошибка 
        💬 Сумма должна быть меньше 10 млн томанов и больше 20 тыс. томанов";
$textbotlang['users']['Balance']['selectPatment'] = "💵 Выберите способ оплаты";
$textbotlang['users']['Balance']['zarinpal'] = "❌ Ошибка 
    Минимальная сумма для оплаты через этот шлюз 5000 томанов.";
$textbotlang['users']['Balance']['linkpayments'] = "Создание платежной ссылки...";
$textbotlang['users']['Balance']['payments'] = "Оплата";
$textbotlang['users']['Balance']['changeto'] = "❌ Ошибка 
    Минимальная сумма для оплаты через этот шлюз 2 TRX.";
$textbotlang['users']['Balance']['errorLinkPayment'] = "❌ Ошибка при создании платежной ссылки, обратитесь в поддержку.";
$textbotlang['users']['Balance']['reject_pay']  = "❌ Отклоненный платеж";
$textbotlang['users']['Balance']['Confirmpayadmin']  = "⭕️ Платеж уже подтвержден";
$textbotlang['users']['Balance']['finished'] = "Ваш платеж успешно подтвержден";
$textbotlang['users']['Balance']['sending'] = "Платеж получен и находится на проверке, пожалуйста, подождите";
$textbotlang['users']['Balance']['expired'] = "Срок действия платежной ссылки истек";
$textbotlang['users']['Balance']['refunded'] = "Средства возвращены на ваш кошелек";
$textbotlang['users']['Balance']['waiting'] = "Ожидание подтверждения платежа";
$textbotlang['users']['Balance']['Failed'] = "⭕️ Ваш платеж не подтвержден";
$textbotlang['users']['Balance']['Confirmpay']  = "✅ Уважаемый пользователь, ваш платеж успешно выполнен и сумма зачислена на ваш счет";
$textbotlang['users']['Balance']['Invalid-receipt'] = "Недопустимая квитанция, требуется только изображение";
$textbotlang['users']['Balance']['Confirmpaying']  = "✅ Подтвердить платеж";
$textbotlang['users']['Balance']['Send-receipt'] ="🚀 Ваша квитанция отправлена, после проверки администратором сумма будет зачислена на ваш кошелек";
$textbotlang['users']['Balance']['Send-receip-buy'] ="🚀 Ваша квитанция отправлена, после проверки администратором ваш заказ будет выполнен";

$textbotlang['users']['changelink']['btntitle'] = "⚙️ Обновить подписку";
$textbotlang['users']['changelink']['warnchange'] = "⚠️ При обновлении ссылки подписки ваши текущие конфиги перестанут работать, и вам нужно будет получить новые конфиги или ссылку подписки в разделе настроек сервиса.";
$textbotlang['users']['changelink']['confirm'] = "Изменить ссылку подключения";
$textbotlang['users']['changelink']['confirmed'] = "✅ Ваша ссылка подключения обновлена, старые конфиги деактивированы. Для получения новых конфигов перейдите в настройки сервиса.";

$textbotlang['users']['removeconfig']['btnremoveuser'] = "💸 Возврат средств";
$textbotlang['users']['removeconfig']['rejectremove'] = "❌Отклонить удаление";
$textbotlang['users']['removeconfig']['accepetrequest'] = "✅ Ваш запрос отправлен, после проверки администратором вы получите уведомление";
$textbotlang['users']['stateus']['notusername'] = "❌ Невозможно удалить сервис.";
$textbotlang['users']['stateus']['errorexits'] = "❌ Уже есть активный запрос, пожалуйста, дождитесь его рассмотрения перед отправкой нового.";
$textbotlang['users']['stateus']['descriptions_removeservice'] = " Нажав кнопку \"✅ У меня есть запрос на удаление сервиса\", вы отправите запрос администрации. После рассмотрения ваш сервис будет отменен.\n\n❌ В случае одобрения администратором, неиспользованная сумма будет возвращена на ваш кошелек.\n\nСпасибо, что пользуетесь нашими услугами.";
$textbotlang['users']['stateus']['exitsrequsts'] = "❌ У вас уже есть активный запрос, дождитесь его рассмотрения перед отправкой нового";
$textbotlang['users']['stateus']['sendrequestsremove'] ="📌 Нажав кнопку \"✅ У меня есть запрос на удаление сервиса\", вы отправите запрос администрации. После рассмотрения ваш сервис будет отменен.\n\n❌ В случае одобрения администратором, неиспользованная сумма будет возвращена на ваш кошелек.\n\nСпасибо, что пользуетесь нашими услугами.";
$textbotlang['users']['stateus']['RemoveSerivecbtn'] = "🗑 Удалить сервис";
$textbotlang['users']['stateus']['InfoSerivceDisable'] = "Статус сервиса: %s
Имя пользователя сервиса: %s
Локация: %s
Код сервиса: %s
    
♾ Общий трафик: %s
📥 Использованный трафик: %s

📅 Активен до: %s (%s)";
$textbotlang['users']['stateus']['InfoSerivceActive'] = "Статус сервиса: %s
Имя пользователя сервиса: %s
Локация: %s
Код сервиса: %s
    
🟢 Последнее подключение: %s
    
♾ Общий трафик: %s
📥 Использованный трафик: %s

📅 Активен до: %s (%s)
    
🚫 Для изменения ссылки и отключения доступа других пользователей просто нажмите 'Обновить подписку'.";
$textbotlang['users']['stateus']['RequestRemove'] = "✅ У меня есть запрос на удаление сервиса";
$textbotlang['users']['stateus']['RemovedService'] = "📌 Сервис успешно удален";
$textbotlang['users']['stateus']['RequestInfoRemove'] = "Привет, администратор 👋
            
📌 Получен запрос на удаление сервиса. Пожалуйста, проверьте и подтвердите, если все верно. 
⚠️ Примечания по подтверждению:
1 - Сумма возврата определяется вами.
            
            
📊 Информация о сервисе пользователя:
ID пользователя: %s
Имя пользователя: @%s
Имя пользователя конфига: %s
Статус сервиса: %s
Локация: %s
Код сервиса: %s
    
📥 Использованный трафик: %s
♾ Общий трафик: %s
🪫 Остаток трафика: %s
📅 Активен до: %s (%s)";
$textbotlang['users']['stateus']['residaccepted'] = "Этот запрос уже рассмотрен другим администратором";
$textbotlang['users']['stateus']['acceptrequest'] = "📌 Запрос на отмену удаления успешно зарегистрирован, укажите причину отказа";
$textbotlang['users']['stateus']['acceptrequestnote'] = "✅ Успешно зарегистрировано";
$textbotlang['users']['stateus']['rejectsendtouser'] = "❌ Уважаемый пользователь, ваш запрос на удаление с именем пользователя %s отклонен. Причина: %s";
$textbotlang['users']['stateus']['getpriceforadd'] = "💰 Укажите сумму для добавления на счет пользователя.";
$textbotlang['users']['stateus']['addedbalanceremove'] = "💰Уважаемый пользователь, сумма %s томанов добавлена на ваш счет.";
$textbotlang['users']['stateus']['acceptrequest'] = "✅ Уважаемый пользователь, ваш запрос на удаление с именем пользователя %s одобрен.";

$textbotlang['users']['Discount']['titlebtn'] = "🎁 Промокод";
$textbotlang['users']['Discount']['getcode']  = "💝 Для получения бонуса введите ваш промокод";
$textbotlang['users']['Discount']['notcode']  = "❌ Неверный код";
$textbotlang['users']['Discount']['onecode']  = "⭕️ Этот код можно использовать только один раз";
$textbotlang['users']['Discount']['getcodesell']  = "🧑‍💻 Введите ваш промокод";
$textbotlang['users']['Discount']['correctcode']  = "🤩 Ваш промокод принят, сумма скорректирована.";
$textbotlang['users']['Discount']['erorrlimit']  = "❌ Лимит использования этого промокода исчерпан";
$textbotlang['users']['Discount']['erorrlimitdiscount']  = "❌ Лимит использования этого бонусного кода исчерпан";
$textbotlang['users']['Discount']['firstdiscount']  = "❌ Этот промокод только для первой покупки";
$textbotlang['users']['Discount']['acceptdiscount']  = "Промокод успешно активирован, на ваш счет добавлено %s томанов. 🥳";

$textbotlang['users']['moeny']['cart_to_Cart_btn'] = "💳 Карта на карту";
$textbotlang['users']['moeny']['nowpaymentbtn'] = "💵 Оплата nowpayments";
$textbotlang['users']['moeny']['currency_rial_gateway'] = "💎 Валютный шлюз";
$textbotlang['users']['moeny']['mr_payment_gateway'] = "🔵 Господин Платеж";
$textbotlang['users']['moeny']['card_number_settings'] = "💳 Настройки номера карты";
$textbotlang['users']['moeny']['alsat_merchant_settings'] = "Настройки мерчанта";
$textbotlang['users']['moeny']['mr_payment_merchant_settings'] = "Настройки мерчанта Господина Платежа";
$textbotlang['users']['moeny']['mr_payment_gateway_status'] = "Статус шлюза Господина Платежа";
$textbotlang['users']['moeny']['nowpayment_api'] = "🧩 API nowpayment";
$textbotlang['users']['moeny']['nowpayment_gateway_status'] = "nowpayments 🔌";
$textbotlang['users']['moeny']['carttext'] =  "Для ручного пополнения баланса переведите %s томанов на следующий счет 👇🏻
    
    ==================== 
    %s
    ====================
    
🌅 Отправьте фото квитанции на этом этапе. 
    
⚠️ Максимальная сумма перевода 10 млн томанов.
⚠️ Вывод средств с кошелька невозможен.
⚠️ Ответственность за ошибочный перевод лежит на вас.";
$textbotlang['users']['moeny']['aqayepardakht'] = "
✅ Платежный счет создан.
        
🔢 Номер счета: %s
💰 Сумма счета: %s томанов
    
    Для оплаты используйте кнопку ниже👇🏻";
$textbotlang['users']['moeny']['nowpayment']  = "
            ✅ Валютный платежный счет NOWPayments создан.
        
🔢 Номер счета: %s
💰 Сумма счета: %s томанов
        
📊 Курс доллара: %s томанов
💵 Итого: %s долларов 
        
        
🌟 Доступны различные валюты для оплаты
        
Для оплаты используйте кнопку ниже👇🏻";
$textbotlang['users']['moeny']['iranpay'] = "✅ Ваша транзакция создана
    
🛒 Код отслеживания:  <code>%s</code> 
🌐 Сеть: TRX
💳 Адрес кошелька: <code>%s</code>
💲 Сумма в TRX: <code>%s</code>
💲 Сумма в томанах: <code>%s</code>
💲 Курс TRX: <code>%s</code>
    
    
    
📌 Сумма %s томанов будет добавлена на ваш кошелек после подтверждения транзакции в блокчейне
    
💢 Пожалуйста, обратите внимание на следующее перед оплатой 👇
    
🔸 При неправильном вводе адреса кошелька транзакция не подтвердится, и возврат невозможен
🔹 Отправляемая сумма не должна быть меньше или больше указанной.
🔸 Комиссия сети оплачивается пользователем, должна быть отправлена точная сумма.
🔹 При переплате разница не возвращается.
🔸 Каждый кошелек можно использовать только для одной транзакции, повторная отправка невозможна.
🔹 Каждая транзакция действительна от 10 до 15 минут.
    
✅ При возникновении проблем обратитесь в поддержку";
$textbotlang['users']['moeny']['eror'] = "
⭕️ Ошибка создания платежной ссылки
✍️ Причина: %s
        
ID пользователя: %s
Имя пользователя: @%s";
$textbotlang['users']['moeny']['cartresid'] = "
                ⭕️ Новый платеж получен.
            
👤 ID пользователя: %s
🛒 Код платежа: %s
⚜️ Имя пользователя: @%s
💸 Сумма: %s томанов
            
Описание: %s
✍️ Подтвердите платеж, если квитанция верна";
$textbotlang['users']['moeny']['Charged.'] = "💎 Уважаемый пользователь, сумма %s томанов зачислена на ваш кошелек. Спасибо за оплату.
                
🛒 Ваш код отслеживания: %s";
$textbotlang['users']['moeny']['acceptedcart'] = "Заказ подтвержден";
$textbotlang['users']['moeny']['acceptedcart'] = "Заказ подтвержден";
$textbotlang['users']['moeny']['rejectresid'] = "❌ Уважаемый пользователь, ваш платеж отклонен по следующей причине.
✍️ %s
🛒 Код платежа: %s";
$textbotlang['users']['moeny']['sendcart'] = "💳 Отправьте номер вашей карты
    
⭕️ Вы можете указать имя владельца карты вместе с номером.
    
💳 Текущий номер вашей карты: %s";
$textbotlang['users']['moeny']['getapinowpayment'] = "⚙️ Отправьте API с сайта nowpayments.io
    
API nowpayment: %s";
$textbotlang['users']['moeny']['getmarchent'] = "💳 Получите ваш мерчант-код от Господина Платежа и введите здесь
    
Текущий мерчант-код: %s";
$textbotlang['users']['moeny']['invalidprice'] = "Неверная сумма";
$textbotlang['users']['moeny']['payment_success'] = "Платеж успешен";
$textbotlang['users']['moeny']['payment_failed'] = "Платеж не прошел";
$textbotlang['users']['moeny']['payment_success_dec'] = "Спасибо за транзакцию";
$textbotlang['users']['moeny']['invoice_title'] = "Платежный счет";
$textbotlang['users']['moeny']['transaction_number'] = "Номер транзакции: ";
$textbotlang['users']['moeny']['payment_amount'] = "Сумма платежа:";
$textbotlang['users']['moeny']['currency'] = "томанов";
$textbotlang['users']['moeny']['date_label'] = "Дата: ";
$textbotlang['users']['moeny']['back_to_bot'] = "Вернуться в бота";
$textbotlang['users']['moeny']['setting'] = "⚙️ Настройки";
$textbotlang['users']['moeny']['settingpay'] = "📌 Выберите и настройте доступные платежные шлюзы";

$textbotlang['users']['format']['byte'] = "байт";
$textbotlang['users']['format']['kilobyte'] = "КБ";
$textbotlang['users']['format']['MBbyte'] = "МБ";
$textbotlang['users']['format']['GBbyte'] = "ГБ";
$textbotlang['users']['format']['TBbyte'] = "ТБ";

#--------------[ other users ]--------------#
$textbotlang['users']['backhome'] = "🏠 На главную";
$textbotlang['users']['backmenu'] = "🏠 Назад в меню";
$textbotlang['users']['time-Service'] = "⏳ Срок сервиса";
$textbotlang['users']['Volume-Service'] = "🌐 Объем сервиса";
$textbotlang['users']['selectoption'] = "Выберите опцию";
$textbotlang['users']['page']['next'] = "Далее";
$textbotlang['users']['page']['previous'] = "Назад";
$textbotlang['users']['Service']['Location'] = "🌏 Выберите локацию сервиса.";
$textbotlang['users']['config'] = " Ваши конфиги:";
$textbotlang['users']['Invalid-comment'] = "❌ Неверная команда ❌";
$textbotlang['users']['selectusername'] = "Отправьте ваше имя пользователя
⚠️ Имя пользователя должно быть без специальных символов (@, пробелы, дефисы). 
⚠️ Имя пользователя должно быть на английском";
$textbotlang['users']['invalidusername'] ="❌Неверное имя пользователя
🔄 Пожалуйста, отправьте имя пользователя снова";
$textbotlang['users']['VerifyUser'] = "⚠️ Ваш аккаунт не верифицирован. Для верификации свяжитесь с поддержкой.";
$textbotlang['users']['updatingbot'] = "❌ Бот обновляется, пожалуйста, попробуйте позже";
$textbotlang['users']['rulesaccept'] = "✅ Принимаю правила";
$textbotlang['users']['customtextandrandom'] = 'Произвольный текст + случайное число';
$textbotlang['users']['customusernameorder'] = 'Имя пользователя + порядковый номер';
$textbotlang['users']['customusernameandorder'] = 'Имя пользователя + случайные буквы и цифры';
$textbotlang['users']['customidAndRandom'] = 'ID + случайные буквы и цифры';
$textbotlang['users']['customusername'] = 'Произвольное имя пользователя';
$textbotlang['users']['sendnumber'] = "☎️ Отправить номер телефона";
$textbotlang['users']['account']  = "
👨🏻‍💻 Информация о вашем аккаунте:
            
👤 Имя: %s
🕴🏻 ID пользователя: <code>%s</code>
💰 Баланс: %s томанов
🛍 Количество купленных сервисов: %s
🤝 Количество рефералов: %s
    
📆 %s → ⏰ %s";
$textbotlang['users']['accountbtn'] = "👨🏻‍💻 Профиль";
$textbotlang['users']['buybtn'] = "🔐 Купить подписку";
$textbotlang['users']['add_balance'] = "💰 Пополнить баланс";
$textbotlang['users']['Percentage'] = " процентов ";
$textbotlang['users']['IRT'] = " томанов ";
$textbotlang['users']['botoff'] =  "❌ Бот выключен, пожалуйста, попробуйте позже";
$textbotlang['users']['pricelist'] = "💰 Тарифы";

$textbotlang['users']['affiliates']['setpercentage'] = "📌 Укажите процент, который будет начисляться пользователю после покупки";
$textbotlang['users']['affiliates']['changedpercentage'] = "✅ Процент начисления успешно установлен";
$textbotlang['users']['affiliates']['banner'] = "⭕️ Отправьте ваш реферальный баннер 
❌ Баннер должен содержать изображение";
$textbotlang['users']['affiliates']['affiliatesyou'] = "❌Невозможно стать рефералом этого ID";
$textbotlang['users']['affiliates']['invalidbanner'] = "❌ Неверный баннер (должен содержать изображение)";
$textbotlang['users']['affiliates']['insertbanner'] = "✅ Ваш баннер успешно сохранен.";
$textbotlang['users']['affiliates']['invalidaffiliates'] = "❌ Вы не можете быть рефералом самого себя";
$textbotlang['users']['affiliates']['priceDiscount'] = "📌 Укажите сумму, которую будет получать пользователь за каждого нового реферала";
$textbotlang['users']['affiliates']['changedpriceDiscount'] = "✅ Сумма за реферала успешно установлена";
$textbotlang['users']['affiliates']['offaffiliates'] = "❌ Реферальная программа отключена";
$textbotlang['users']['affiliates']['affiliateseduser'] = "❌ Вы уже являетесь рефералом пользователя %s и не можете быть рефералом другого пользователя";
$textbotlang['users']['affiliates']['giftuser'] = "🎁 Сумма %s зачислена на ваш счет от реферала с ID %s.";
$textbotlang['users']['affiliates']['porsantafterbuy'] = "🎁 Реферальный бонус 
    
Сумма %s томанов зачислена на ваш счет от вашего реферала.";
$textbotlang['users']['affiliates']['btn'] = "👥 Реферальная программа";
$textbotlang['users']['affiliates']['infotext'] = "🤔 Как работает реферальная программа?
    
👨🏻‍💻 Мы создали систему, где вы можете увеличивать баланс своего кошелька без вложений, просто приглашая друзей.
    
👥 Приглашайте друзей по своей реферальной ссылке и получайте бонусы за их покупки.

👤 Вы можете использовать баннер выше для приглашения друзей.
    
💵 Бонус за регистрацию:  %s
💴 Процент с покупок рефералов:  %s";
$textbotlang['users']['closelist'] = "❌ Закрыть список";

$textbotlang['users']['cron']['textbuy'] = "🛍 Купить сервис";
$textbotlang['users']['cron']['crontest'] = "Уважаемый пользователь, 
срок действия вашего тестового сервиса с именем пользователя %s истек.
Надеемся, вам понравились скорость и качество нашего сервиса. Если тестовый период вас устроил, вы можете приобрести полноценный сервис и наслаждаться свободным интернетом с максимальной скоростью😉🔥
🛍 Для покупки сервиса нажмите кнопку ниже";
$textbotlang['users']['cron']['cronday'] = "Уважаемый пользователь 👋
📌 До окончания срока действия сервиса %s осталось %s дней. Пожалуйста, воспользуйтесь разделом «{%s}» для продления сервиса. Спасибо за использование наших услуг";
$textbotlang['users']['cron']['cronvolume'] = "Уважаемый пользователь 👋
🚨 В вашем сервисе %s осталось только %s трафика. Пожалуйста, воспользуйтесь разделом «{%s}» для покупки дополнительного трафика или продления сервиса";
$textbotlang['users']['cron']['removeexpire'] = "📌 Уважаемый пользователь, ваш сервис %s был удален из списка ваших сервисов из-за непродления.

🌟 Для покупки нового сервиса воспользуйтесь разделом покупки сервисов";
$textbotlang['users']['cron']['sendedmessage'] = "📌 Сообщение отправлено всем пользователям.";

#--------------[ admin ]--------------#
$textbotlang['Admin']['commendadmin'] = "Админ";
$textbotlang['Admin']['commendadminmanagment'] = "Панель управления";
$textbotlang['Admin']['Unauthorized-entry'] = "Уважаемый администратор, пользователь пытался войти в админ-панель 
Имя пользователя: @%s
ID: %s
Имя пользователя: %s";
$textbotlang['Admin']['login-admin'] = "
Привет 😍
⭕️ Текущая версия вашего бота: %s

Канал: @mirzapanel
Группа: @mirzapanelgroup

❓Инструкция: 
1 - Для добавления панели нажмите кнопку панели и затем кнопку добавления панели.
2- В разделе финансов вы можете настроить статус платежных шлюзов и мерчантов
3- Валютный шлюз требует только настройки API nowpayments, все остальные настройки кошелька и т.д. на сайте nowpayments";
$textbotlang['Admin']['Back-Admin'] = "Вы вернулись в админ-панель!";
$textbotlang['Admin']['Back-Adminment'] = "🏠 Назад в панель управления";
$textbotlang['Admin']['Addedadmin'] = "👨‍💻 Добавить администратора";
$textbotlang['Admin']['Removeedadmin'] = "❌ Удалить администратора";
$textbotlang['Admin']['not-user'] = "Пользователь с этим ID не найден";
$textbotlang['Admin']['invalidvalue'] = "⭕️ Неверный ввод";
$textbotlang['Admin']['maxvalue'] = "❌ Сумма возврата превышает стоимость продукта!";
$textbotlang['Admin']['turnon'] = "✅ Вкл";
$textbotlang['Admin']['turnoff'] = "❌ Выкл";

$textbotlang['Admin']['channel']['changechannel'] = "Для настройки обязательного канала подписки введите ID канала без @.
    Текущий канал: @";
$textbotlang['Admin']['channel']['setchannel'] = "🔰 Канал успешно настроен.
❌❌ Для работы обязательной подписки бот должен быть администратором канала.";
$textbotlang['Admin']['channel']['setting'] = "📯 Настройки канала";
$textbotlang['Admin']['channel']['changechannelbtn'] = "📣 Настроить канал для подписки";
$textbotlang['Admin']['channel']['channelreport'] = "📣 Настроить канал отчетов";

$textbotlang['Admin']['Statistics']['info'] = "
📊 Общая статистика бота  

📌 Всего пользователей: %s
📌 Общий баланс пользователей: %s
📌 Пинг бота: %s
📌 Количество тестовых аккаунтов: %s
📌 Всего продаж: %s
📌 Общая сумма продаж: %s томанов
📌 Продажи за последние 24 часа: %s
📌 Количество панелей: %s";

$textbotlang['Admin']['manageadmin']['getid'] ="🌟Введите ID администратора";
$textbotlang['Admin']['manageadmin']['addadminset'] ="🥳 Администратор успешно добавлен";
$textbotlang['Admin']['manageadmin']['setrule'] ="⭕️ Укажите уровень доступа администратора:
Уровень administrator имеет доступ ко всем разделам
Уровень Seller имеет доступ только к разделам подтверждения платежей, услугам пользователей, статистике бота
Уровень support имеет доступ только к разделам услуг пользователей и ответам на сообщения поддержки";
$textbotlang['Admin']['manageadmin']['removedadmin'] ="✅ Администратор успешно удален.";
$textbotlang['Admin']['manageadmin']['InfoAdd'] ="❌Невозможно удалить главного администратора. Для смены главного администратора измените ID в файле config.php, затем удалите через этот раздел";
$textbotlang['Admin']['manageadmin']['showlistbtn'] = "📜 Показать список администраторов";
$textbotlang['Admin']['manageadmin']['showlist'] = "👨‍🔧 ID администраторов: \n\n %s";

$textbotlang['Admin']['manageusertest']['getidlimit'] = " ⚜️ Введите ID пользователя
Примечание: Здесь вы можете изменить лимит создания тестовых аккаунтов для пользователя. По умолчанию лимит равен 1.";
$textbotlang['Admin']['getlimitusertest']['getid'] = "ID получен, введите количество тестовых аккаунтов";
$textbotlang['Admin']['getlimitusertest']['setlimit'] = "Лимит для пользователя установлен.";
$textbotlang['Admin']['getlimitusertest']['limitall'] = "Введите количество тестовых аккаунтов для всех пользователей.";
$textbotlang['Admin']['getlimitusertest']['setlimitall'] = "Лимит тестовых аккаунтов для всех пользователей установлен";
$textbotlang['Admin']['getlimitusertest']['setlimitallbtn'] = "➕ Лимит тестовых аккаунтов для всех";
$textbotlang['Admin']['getlimitusertest']['setlimitbtn'] = "➕ Лимит тестовых аккаунтов";

$textbotlang['Admin']['sumuser'] = "👤 Всего пользователей";
$textbotlang['Admin']['sumusertest'] = "🖥 Всего тестовых аккаунтов";
$textbotlang['Admin']['phpversion'] = "👨‍💻 Версия PHP хостинга";
$textbotlang['Admin']['pingbot'] = "🚀 Пинг бота";
$textbotlang['Admin']['sellservices'] = "🛍 Всего продаж ";
$textbotlang['Admin']['dayListSell'] = "☀️ Продажи за сегодня";
$textbotlang['Admin']['Balanceall'] = "💰 Общий баланс пользователей";
$textbotlang['Admin']['sumporoduct'] = "🛍 Всего заказов";
$textbotlang['Admin']['accept'] = "Подтвердить";

$textbotlang['Admin']['managepanel']['selectpanel'] = "Выберите вашу панель";
$textbotlang['Admin']['managepanel']['paneldeactive'] = "❌ Панель в данный момент неактивна.";
$textbotlang['Admin']['managepanel']['notsetlinksub'] = "❌ Уважаемый администратор, панель ниже неактивна. Для активации панели необходимо настроить ссылку подписки в панели и в боте. Затем вы можете настроить выдачу конфигов или ссылок подписки через управление панелями.
Имя панели: %s";
$textbotlang['Admin']['managepanel']['connectx-ui'] = "✅ Панель подключена";
$textbotlang['Admin']['managepanel']['errorstateuspanel'] = "Невозможно подключиться к панели 😔
            
⭕️ Если домен введен правильно, эта ошибка возникает из-за закрытого порта панели на хостинге бота.
    
Решение 1: Измените порт панели на 443 или 8080 - эти порты всегда открыты
⚠️ Если панель использует порт 443, иногда он работает с портом, иногда без
Решение 2: Обратитесь в поддержку хостинга с запросом на открытие порта для вашей панели";
$textbotlang['Admin']['managepanel']['addpanelname']= "Для добавления панели в бота сначала введите имя для панели
                
⚠️ Внимание: Имя панели отображается при поиске и операциях.";
$textbotlang['Admin']['managepanel']['addpanelurl'] = "🔗 Имя панели сохранено, теперь введите URL панели
    ⚠️ Внимание:
    🔸 URL панели должен быть без /dashboard.
    🔹 Если панель использует порт 443, не указывайте порт. (Иногда порт обязателен)
    🔸 URL не должен заканчиваться на /
    🔹 При использовании IP обязательно укажите http или https";
$textbotlang['Admin']['managepanel']['Invalid-domain'] = "🔗 Неверный домен";
$textbotlang['Admin']['managepanel']['usernameset'] ="👤 URL панели сохранен, введите имя пользователя";
$textbotlang['Admin']['managepanel']['getpassword'] = "🔑 Введите пароль панели";
$textbotlang['Admin']['managepanel']['addedpanel'] = "Поздравляем, ваша панель успешно добавлена";
$textbotlang['Admin']['managepanel']['GetRemoveNamePanel'] = "Выберите панель для удаления.";
$textbotlang['Admin']['managepanel']['RemovedPanel'] = "Панель успешно удалена";
$textbotlang['Admin']['managepanel']['nullpanel'] = "⭕️ Локация не найдена, обратитесь в поддержку";
$textbotlang['Admin']['managepanel']['nullpaneladmin'] = "Панель не настроена, сначала добавьте панель, затем продукты";
$textbotlang['Admin']['managepanel']['getloc'] = "Для редактирования панели введите имя панели";
$textbotlang['Admin']['managepanel']['GetNameNew'] = "Введите новое имя панели";
$textbotlang['Admin']['managepanel']['ChangedNmaePanel'] = "✅ Имя панели успешно изменено.";
$textbotlang['Admin']['managepanel']['geturlnew'] = " Введите новый URL панели";
$textbotlang['Admin']['managepanel']['ChangedurlPanel'] = "✅ URL панели успешно изменен.";
$textbotlang['Admin']['managepanel']['Repeatpanel'] = "❌ Имя панели уже используется";
$textbotlang['Admin']['managepanel']['customnamesend'] = "Введите ваш текст";
$textbotlang['Admin']['managepanel']['invalidname'] = "Неверное имя";
$textbotlang['Admin']['managepanel']['savedname'] = "✅ Имя успешно сохранено";
$textbotlang['Admin']['managepanel']['getusernamenew'] = " Введите новое имя пользователя панели";
$textbotlang['Admin']['managepanel']['ChangedusernamePanel'] = "✅ Имя пользователя панели успешно изменено.";
$textbotlang['Admin']['managepanel']['getpasswordnew'] = "Введите новый пароль панели";
$textbotlang['Admin']['managepanel']['ChangedpasswordPanel'] = "✅ Пароль панели успешно изменен.";
$textbotlang['Admin']['managepanel']['btnshowconnect'] = "🔌 Статус подключения панели";
$textbotlang['Admin']['managepanel']['infomarzban'] = "
    Статистика вашей панели👇:
                                 
🖥 Статус подключения панели Marzban: ✅ Панель подключена
👥  Всего пользователей: %s
👤 Активных пользователей: %s
📡 Версия панели Marzban:  %s
 💻 Общая память сервера: %s
💻 Используемая память панели: %s
🌐 Общий использованный трафик (Ап/Вниз): %s";
$textbotlang['Admin']['managepanel']['infomarzneshin'] = "
    Статистика вашей панели👇:
🖥 Статус подключения панели Marzban: ✅ Панель подключена
👥  Всего пользователей: %s
👤 Активных пользователей: %s";
$textbotlang['Admin']['managepanel']['Incorrectinfo'] = "❌ Неверное имя пользователя или пароль панели";
$textbotlang['Admin']['managepanel']['selecttypepanel'] = "📌 Укажите тип панели
    
⚠️ При выборе панели S-ui после добавления перейдите в раздел редактирования панели > настройки inbound и укажите ID inbound";
$textbotlang['Admin']['managepanel']['settoken'] = "📌 Создайте токен в панели S-ui в разделе администратора и введите его здесь.";
$textbotlang['Admin']['managepanel']['notex-ui'] = "📌 Примечания после добавления панели:‌

1 - В управлении панелями > настройки inbound укажите ID inbound, который будет использоваться для создания конфигов";
$textbotlang['Admin']['managepanel']['notemarzban'] = "📌 Примечания после добавления панели:‌

1 - В управлении панелями > настройки протокола и inbound введите имя существующего пользователя панели.";
$textbotlang['Admin']['managepanel']['wgdashboard'] = "❌ Важно:
Для активации панели перейдите в управление панелями > настройки inbound и укажите имя конфига. Иначе бот не будет создавать конфиги";
$textbotlang['Admin']['managepanel']['showpanelbtn'] = "👁‍🗨 Статус отображения панели";
$textbotlang['Admin']['managepanel']['showpaneltestbtn'] = "🎁 Статус тестового аккаунта";
$textbotlang['Admin']['managepanel']['showpaneltestdec'] = "📌 Здесь вы можете указать, будет ли панель доступна пользователям для покупки";
$textbotlang['Admin']['managepanel']['showpaneldec'] = "📌 Здесь вы можете указать, будет ли панель доступна для тестовых аккаунтов. Если включить эту функцию, отключите отображение панели для покупок";
$textbotlang['Admin']['managepanel']['offpanel'] = "Выключено.";
$textbotlang['Admin']['managepanel']['onpanel'] = "Включено.";
$textbotlang['Admin']['managepanel']['sublinkstatus'] = "🔗 Отправка ссылки подписки";
$textbotlang['Admin']['managepanel']['configstatus'] = "⚙️Отправка конфигов";
$textbotlang['Admin']['managepanel']['checkoffconfig'] = "Сначала отключите отправку конфигов";
$textbotlang['Admin']['managepanel']['methodusername'] = "💡 Метод создания имени пользователя";
$textbotlang['Admin']['managepanel']['decmthodusername'] = "⭕️ Выберите метод создания имен пользователей для аккаунтов.
    
    ⚠️ Если у пользователя нет имени, будет использовано NOT_USERNAME.
    
    ⚠️ Если имя есть, будет добавлено случайное число";
$textbotlang['Admin']['managepanel']['keyboardpanel']['namepanel'] = "✍️ Имя панели";
$textbotlang['Admin']['managepanel']['keyboardpanel']['editurl'] = "🔗 Редактировать URL панели";
$textbotlang['Admin']['managepanel']['keyboardpanel']['editpassword'] = "🔐 Изменить пароль";
$textbotlang['Admin']['managepanel']['keyboardpanel']['editusername'] = "👤 Изменить имя пользователя";
$textbotlang['Admin']['managepanel']['keyboardpanel']['editinound'] = "💎 Настроить ID inbound";
$textbotlang['Admin']['managepanel']['keyboardpanel']['getidinbound'] = "📌 Введите ID inbound для создания конфигов.

❌ Для панелей wgdashboard введите имя конфига";
$textbotlang['Admin']['managepanel']['keyboardpanel']['setinbound'] = "✅ ID inbound успешно сохранен";
$textbotlang['Admin']['managepanel']['keyboardpanel']['linksub'] = "🔗 Домен ссылки подписки";
$textbotlang['Admin']['managepanel']['keyboardpanel']['removepanel'] = "❌ Удалить панель";
$textbotlang['Admin']['managepanel']['keyboardpanel']['setvolume'] = "➕ Настроить цену доп. трафика";
$textbotlang['Admin']['managepanel']['keyboardpanel']['on_hold_status'] = "⏳ Функция первого подключения";
$textbotlang['Admin']['managepanel']['keyboardpanel']['usernotfount'] = "Пользователь не найден в панели";
$textbotlang['Admin']['managepanel']['setsetting'] = "✅ Настройки успешно сохранены";
$textbotlang['Admin']['managepanel']['setinbound'] = "⚙️ Настроить протокол и inbound";
$textbotlang['Admin']['managepanel']['setinbounddec'] = "📌 Для настройки inbound и протоколов создайте конфиг в панели, активируйте нужные протоколы и inbound, затем введите имя пользователя конфига";
$textbotlang['Admin']['managepanel']['setedinbound'] = "✅ Ваши inbound и протоколы успешно настроены.";
$textbotlang['Admin']['managepanel']['notoffsublink'] = "Сначала отключите ссылку подписки";

$textbotlang['Admin']['ManageUser']['SendMessageuser'] = "✅ Сообщение успешно отправлено пользователю.";
$textbotlang['Admin']['ManageUser']['GetTextResponse'] = "Для ответа пользователю введите ваш текст.";
$textbotlang['Admin']['ManageUser']['GetText'] = "Введите ваш текст";
$textbotlang['Admin']['ManageUser']['ForwardGetext'] = "Введите текст для пересылки";
$textbotlang['Admin']['ManageUser']['ForwardSendAllUser'] = "✅ Сообщение переслано всем пользователям.";
$textbotlang['Admin']['ManageUser']['MessageSent'] = "✅ Сообщение отправлено";
$textbotlang['Admin']['ManageUser']['ChangeTextGet'] = " Введите новый текст.
Текущий текст:";
$textbotlang['Admin']['ManageUser']['GetIDMessage'] = "✅ Текст получен, теперь введите ID пользователя.";
$textbotlang['Admin']['ManageUser']['ErrorText'] = "Можно отправлять только текст";
$textbotlang['Admin']['ManageUser']['SaveText'] = "✅ Текст успешно сохранен";
$textbotlang['Admin']['ManageUser']['BlockUserId'] = "👤 Введите ID пользователя";
$textbotlang['Admin']['ManageUser']['BlockedUser'] = "🚫 Вы заблокированы администрацией.

✍️ Причина блокировки: %s";
$textbotlang['Admin']['ManageUser']['BlockedUser'] = "Пользователь уже заблокирован❗️";
$textbotlang['Admin']['ManageUser']['BlockUser'] = "🚫 Пользователь заблокирован, теперь укажите причину блокировки.";
$textbotlang['Admin']['ManageUser']['RemoveService'] = "Здесь вы можете удалить сервис пользователя.
Для удаления введите имя пользователя, зарегистрированное в панели";
$textbotlang['Admin']['ManageUser']['RemovedService'] = "✅ Сервис пользователя удален.";
$textbotlang['Admin']['ManageUser']['DescriptionBlock'] = "✍️ Причина блокировки сохранена";
$textbotlang['Admin']['ManageUser']['GetIdUserunblock'] = "👤 Введите ID пользователя";
$textbotlang['Admin']['ManageUser']['UserNotBlock'] = "Пользователь не заблокирован 😐";
$textbotlang['Admin']['ManageUser']['UserUnblocked'] = "Пользователь разблокирован. 🤩";
$textbotlang['Admin']['ManageUser']['Acceptedphone'] = "Подтвержден";
$textbotlang['Admin']['ManageUser']['Failedphone'] = "Не подтвержден";
$textbotlang['Admin']['ManageUser']['dataorder'] = "Дата не указана";
$textbotlang['Admin']['ManageUser']['SendOrder'] = "Список заказов пользователя отправлен";
$textbotlang['Admin']['ManageUser']['mangebtnuserdec'] = "⭕️ Здесь вы можете просмотреть всех пользователей 
⚠️ Для управления пользователем нажмите кнопку управления рядом с пользователем";
$textbotlang['Admin']['ManageUser']['backlistuser'] = "🏠 Назад к списку пользователей";
$textbotlang['Admin']['ManageUser']['addbalanceuser'] = "👆Пополнить баланс";
$textbotlang['Admin']['ManageUser']['lowbalanceuser'] = "👇 Списать средства";
$textbotlang['Admin']['ManageUser']['addbalanceuserdec'] = "⭕️ Введите сумму для пополнения";
$textbotlang['Admin']['ManageUser']['lowbalanceuserdec'] = "⭕️ Введите сумму для списания";
$textbotlang['Admin']['ManageUser']['addbalanced'] = "✅ Средства успешно зачислены на счет пользователя.";
$textbotlang['Admin']['ManageUser']['lowbalanced'] = "✅ Средства успешно списаны со счета пользователя.";
$textbotlang['Admin']['Balance']['AddBalanceUsers'] = "✅ Средства зачислены пользователям";
$textbotlang['Admin']['ManageUser']['banuserlist'] = "🔒 Заблокировать пользователя";
$textbotlang['Admin']['ManageUser']['unbanuserlist'] = "🔓 Разблокировать пользователя";
$textbotlang['Admin']['ManageUser']['confirmnumber'] = "Ручное подтверждение номера";
$textbotlang['Admin']['ManageUser']['verifynumber'] = "Верификация номера";
$textbotlang['Admin']['ManageUser']['verifynumberirani'] = "Подтвердить иранский номер 🇮🇷";
$textbotlang['Admin']['ManageUser']['vieworderuser'] = "🛍 Просмотр заказов пользователя";
$textbotlang['Admin']['ManageUser']['searchorder'] = "🛍 Поиск заказа";
$textbotlang['Admin']['ManageUser']['ViewOrder'] = "👁 Для просмотра заказа введите ID пользователя";
$textbotlang['Admin']['ManageUser']['OrderNotFound'] = "❌ Заказ не найден";
$textbotlang['Admin']['ManageUser']['viewpaymentuser'] = "💰 Просмотр платежей пользователя";
$textbotlang['Admin']['ManageUser']['sendpayemntlist'] = "✅ Список платежей пользователя отправлен";
$textbotlang['Admin']['ManageUser']['removeservice'] = "❌ Удалить заказ";
$textbotlang['Admin']['ManageUser']['removeserviceandback'] = "❌ Удалить заказ и вернуть средства";
$textbotlang['Admin']['ManageUser']['sendmessageUser'] = "Отправить сообщение пользователю";
$textbotlang['Admin']['ManageUser']['NewUserMessage'] = "
🎉Новый пользователь запустил бота
Имя: %s
Имя пользователя: @%s
ID: <a href = \"tg://user?id=%s\">%s</a>";
$textbotlang['Admin']['ManageUser']['Datails'] = "
🛒 Номер заказа:  <code>%s</code>
Статус заказа: <code>%s</code>
🙍‍♂️ ID пользователя: <code>%s</code>
👤 Имя пользователя:  <code>%s</code> 
📍 Локация сервиса:  %s
🛍 Название продукта:  %s
💰 Стоимость сервиса:  %s томанов
⚜️ Объем сервиса: %s
⏳ Срок действия сервиса: %s дней
📆 Дата покупки: %s";
$textbotlang['Admin']['ManageUser']['removeorderbtn'] = "❌ Удалить сервис пользователя";
$textbotlang['Admin']['ManageUser']['verify'] = "Верификация";
$textbotlang['Admin']['ManageUser']['verifyed'] = "Пользователь не был верифицирован";
$textbotlang['Admin']['ManageUser']['verifyeduser'] = "Пользователь уже верифицирован";
$textbotlang['Admin']['ManageUser']['unverifyed'] = "✅ Пользователь успешно снят с верификации.";
$textbotlang['Admin']['ManageUser']['verifyeduser'] = "✅ Пользователь успешно верифицирован.";
$textbotlang['Admin']['ManageUser']['removeverify'] = "Снять верификацию";
$textbotlang['Admin']['ManageUser']['infouser'] = "👀 Информация о пользователе:

⭕️ Статус: %s
⭕️ Имя пользователя: @%s
⭕️ ID:  <a href = \"tg://user?id=%s\">%s</a>
⭕️ Последняя активность: %s
⭕️ Лимит тестовых аккаунтов:  %s
⭕️ Статус принятия правил: %s
⭕️ Номер телефона: <code>%s</code>
⭕️ Баланс: %s
⭕️ Всего покупок: %s
⭕️ Общая сумма платежей:  %s
⭕️ Всего заказов: %s
⭕️ Количество рефералов: %s
⭕  Реферер: %s
⭕  Статус верификации: %s";

$textbotlang['Admin']['systemsms']['sendbulkbtn'] = "✉️ Массовая рассылка";
$textbotlang['Admin']['systemsms']['forwardbulkbtn'] = "📤 Массовая пересылка";
$textbotlang['Admin']['systemsms']['allowsendtext'] = "Разрешена только отправка текста";
$textbotlang['Admin']['systemsms']['acceptsend'] = "Для подтверждения отправьте следующий текст
    Подтвердить";
$textbotlang['Admin']['systemsms']['cancelsend'] = "Отменить отправку";
$textbotlang['Admin']['systemsms']['sendingmessage'] = "📌 Ваше сообщение поставлено в очередь отправки. После завершения вы получите уведомление (отправка может занять до 8 часов из-за ограничений Telegram)";
$textbotlang['Admin']['systemsms']['canceledmessage'] = "📌 Отправка сообщения отменена.";
$textbotlang['Admin']['systemsms']['sendingforward'] = "Отправка сообщения";
$textbotlang['Admin']['systemsms']['sendforwardtousers'] = "✅ Сообщение отправлено всем пользователям";
$textbotlang['Admin']['systemsms']['sendmessageauser'] = "✍️ Отправить сообщение одному пользователю";
$textbotlang['Admin']['systemsms']['sendedmessagetouser'] = "📩 Вам сообщение от администрации  
Текст: %s";

$textbotlang['Admin']['changetext']['textstart'] = "Настроить приветственный текст";
$textbotlang['Admin']['changetext']['text_Purchased_services'] = "Кнопка купленных сервисов";
$textbotlang['Admin']['changetext']['text_usertest'] = "Кнопка тестового аккаунта";
$textbotlang['Admin']['changetext']['text_help'] = "Текст кнопки 📚 Обучение";
$textbotlang['Admin']['changetext']['text_support'] = "Текст кнопки ☎️ Поддержка";
$textbotlang['Admin']['changetext']['text_fq'] = "Кнопка частых вопросов";
$textbotlang['Admin']['changetext']['text_dec_fq'] = "📝 Настроить текст частых вопросов";
$textbotlang['Admin']['changetext']['text_channel'] = "📝 Настроить текст обязательной подписки";
$textbotlang['Admin']['changetext']['text_account'] = "Текст кнопки аккаунта";
$textbotlang['Admin']['changetext']['text_Add_Balance'] = "Кнопка пополнения баланса";
$textbotlang['Admin']['changetext']['text_Tariff_list'] = "Текст кнопки списка тарифов";
$textbotlang['Admin']['changetext']['text_dec_Tariff_list'] = "Текст описания списка тарифов";
$textbotlang['Admin']['changetext']['ruletext'] = "⚖️ Текст правил";

$textbotlang['Admin']['Help']['titlebtn'] = "📚 Раздел обучения";
$textbotlang['Admin']['Help']['addhelp'] = "📚 Добавить обучение";
$textbotlang['Admin']['Help']['edithelp'] = "✏️ Редактировать обучение";
$textbotlang['Admin']['Help']['selecthelpforedit'] = "📌 Выберите обучение.";
$textbotlang['Admin']['Help']['removehelpbtn'] = "❌ Удалить обучение";
$textbotlang['Admin']['Help']['GetAddNameHelp'] ="Для добавления обучения введите название 
⚠️ Внимание: Название отображается пользователям в списке.";
$textbotlang['Admin']['Help']['GetAddDecHelp'] = " 🔗 Название сохранено, теперь введите описание 
⚠️ Внимание:
🔸 Описание может содержать изображения или видео";
$textbotlang['Admin']['Help']['SaveHelp'] = "✅ Обучение успешно сохранено";
$textbotlang['Admin']['Help']['SelectName'] = "Выберите название обучения";
$textbotlang['Admin']['Help']['RemoveHelp'] = "✅ Обучение удалено.";
$textbotlang['Admin']['Help']['statushelp'] = "💡 Статус раздела обучения";
$textbotlang['Admin']['Help']['change']['name'] = "Изменить название";
$textbotlang['Admin']['Help']['change']['sendnewname'] = "Введите новое название";
$textbotlang['Admin']['Help']['change']['namemax'] = "❌ Название должно быть короче 150 символов";
$textbotlang['Admin']['Help']['change']['updated'] = "✅ Обучение обновлено";
$textbotlang['Admin']['Help']['change']['dec'] = "Изменить описание";
$textbotlang['Admin']['Help']['change']['newdec'] = "Введите новое описание";
$textbotlang['Admin']['Help']['change']['editmedia'] = "Изменить медиа";
$textbotlang['Admin']['Help']['change']['editmedianew'] = "Отправьте новое изображение или видео";

$textbotlang['Admin']['Status']['title'] ="🛍 Мои сервисы";
$textbotlang['Admin']['Status']['btn'] ="📈 Статистика вашего бота";
$textbotlang['Admin']['Status']['subject'] = "Название";
$textbotlang['Admin']['Status']['statussubject'] = "Статус";
$textbotlang['Admin']['Status']['statuson'] = "✅ Вкл";
$textbotlang['Admin']['Status']['statusoff'] = "❌ Выкл";
$textbotlang['Admin']['Status']['BotTitle'] = "📌 Здесь вы можете включить/выключить следующие функции.";
$textbotlang['Admin']['Status']['stautsbot'] = "📡 Статус бота";
$textbotlang['Admin']['Status']['onhold'] = "Функция первого подключения сервиса";
$textbotlang['Admin']['Status']['onstatus'] = "Включено";
$textbotlang['Admin']['Status']['offstatus'] = "Выключено";
$textbotlang['Admin']['Status']['subTitle'] = "Здесь вы можете настроить, будет ли пользователь получать ссылку подписки после покупки";
$textbotlang['Admin']['Status']['subStatusOff'] = "⭕️ Отправка ссылки подписки отключена. Пользователи больше не будут получать ссылку после покупки.";
$textbotlang['Admin']['Status']['subStatuson'] = "Отправка ссылки подписки включена. Пользователи будут получать ссылку после покупки";
$textbotlang['Admin']['Status']['configTitle'] = "Здесь вы можете настроить, будет ли пользователь получать ручные конфиги после покупки";
$textbotlang['Admin']['Status']['configStatusOff'] = "⭕️ Отправка ручных конфигов отключена. Пользователи больше не будут получать конфиги после покупки.";
$textbotlang['Admin']['Status']['configStatuson'] = "Отправка конфигов после покупки включена. Пользователи будут получать ручные конфиги";
$textbotlang['Admin']['Status']['affiliates'] = "📌 Здесь вы можете включить/выключить реферальную программу";
$textbotlang['Admin']['Status']['affiliatesStatusOff'] = "Реферальная программа отключена";
$textbotlang['Admin']['Status']['affiliatesStatuson'] = "Реферальная программа включена";
$textbotlang['Admin']['Status']['commission'] = "Статус бонуса за запуск бота";
$textbotlang['Admin']['Status']['commissionStatusOff'] = "Реферальные бонусы отключены";
$textbotlang['Admin']['Status']['commissionStatuson'] = "Реферальные бонусы включены";
$textbotlang['Admin']['Status']['Discountaffiliates'] = "Статус бонусной программы";
$textbotlang['Admin']['Status']['DiscountaffiliatesStatusOff'] = "Бонусная программа отключена";
$textbotlang['Admin']['Status']['DiscountaffiliatesStatuson'] = "Бонусная программа включена";
$textbotlang['Admin']['Status']['notusenameinbot'] = "🔍 Моего имени нет в списке";

$textbotlang['Admin']['phone']['notactive'] = "🛑Номер не подтвержден🛑";
$textbotlang['Admin']['phone']['active'] = "Номер подтвержден ✅🎉";
$textbotlang['Admin']['phone']['NotSend'] = "Пользователь не отправил номер";

$textbotlang['Admin']['Channel']['ReportChannel'] = "📣Введите ID канала или группы для уведомлений
Для получения ID канала отправьте сообщение в канал и перешлите его боту @myidbot
Для группы добавьте бота и отправьте команду /id
Текущий ID:";
$textbotlang['Admin']['Channel']['SetChannelReport'] ="🔰 Канал успешно настроен";
$textbotlang['Admin']['Channel']['TestChannel'] = "Тест отправки в канал отчетов";

$textbotlang['Admin']['Product']['addproduct'] = "🛍 Добавить продукт";
$textbotlang['Admin']['Product']['Service_location'] ="📌 Выберите локацию продукта
 ⭕️ Для добавления продукта во все локации отправьте /all";
$textbotlang['Admin']['Product']['nullpProduct']   = "⭕️ Продукты не найдены, обратитесь в поддержку";
$textbotlang['Admin']['Product']['Rmove_location'] ="📌 Выберите локацию продукта";
$textbotlang['Admin']['Product']['selectRemoveProduct'] ="Выберите продукт для удаления";
$textbotlang['Admin']['Product']['selectEditProduct'] ="Выберите продукт для редактирования";
$textbotlang['Admin']['Product']['selectfieldProduct'] ="Выберите поле для редактирования";
$textbotlang['Admin']['Product']['RemoveedProduct'] ="✅ Продукт успешно удален.";
$textbotlang['Admin']['Product']['AddProductStepOne'] = "Сначала введите название подписки
⚠️ Важно:
• В названии укажите цену подписки.
• В названии укажите срок подписки.";
$textbotlang['Admin']['Product']['GetLimit'] = "Введите объем подписки в ГБ

Для безлимитного трафика введите 0";
$textbotlang['Admin']['Product']['Getcategory'] = "Выберите категорию продукта";
$textbotlang['Admin']['Product']['Invalidvolume'] = "Неверный объем";
$textbotlang['Admin']['Product']['GettIime'] = "
Введите срок подписки в днях
Для бессрочной подписки введите 0";
$textbotlang['Admin']['Product']['InvalidTime'] = "Неверный срок";
$textbotlang['Admin']['Product']['GetPrice'] = "
Введите цену подписки.
Внимание: 
Цена указывается в томанах, без дополнительных символов.";
$textbotlang['Admin']['Product']['InvalidPrice'] = "Неверная цена";
$textbotlang['Admin']['Product']['SaveProduct'] = "Продукт успешно сохранен 🥳🎉";
$textbotlang['Admin']['Product']['TimeUpdated'] = "✅ Срок продукта обновлен";
$textbotlang['Admin']['Product']['NewTime'] = "Введите новый срок";
$textbotlang['Admin']['Product']['invalidcategory'] = "Неверная категория";
$textbotlang['Admin']['Product']['titlebtnremove'] = "❌ Удалить продукт";
$textbotlang['Admin']['Product']['titlebtnedit'] = "✏️ Редактировать продукт";
$textbotlang['Admin']['Product']['editprice'] = "Цена";
$textbotlang['Admin']['Product']['sendnewprice'] = "Введите новую цену";
$textbotlang['Admin']['Product']['updatedprice'] = "✅ Цена продукта обновлена";
$textbotlang['Admin']['Product']['editcategory'] = "Категория";
$textbotlang['Admin']['Product']['sendnewcategory'] = "Введите новую категорию";
$textbotlang['Admin']['Product']['updatedcategory'] = "✅ Категория продукта обновлена";
$textbotlang['Admin']['Product']['editname'] = "Название";
$textbotlang['Admin']['Product']['sendnewname'] = "Введите новое название";
$textbotlang['Admin']['Product']['updatedname'] = "✅Название продукта обновлено";
$textbotlang['Admin']['Product']['updatedcategory'] = "✅ Категория продукта обновлена";
$textbotlang['Admin']['Product']['editvolume'] = "Объем";
$textbotlang['Admin']['Product']['sendnewvolume'] = "Введите новый объем";
$textbotlang['Admin']['Product']['updatedvolume'] = "✅Объем продукта обновлен";
$textbotlang['Admin']['Product']['edittime'] = "Срок";

$textbotlang['Admin']['Payment']['reviewedpayment'] = "❌ Этот платеж уже проверен другим администратором";
$textbotlang['Admin']['Payment']['Reasonrejecting'] = "Укажите причину отклонения платежа";
$textbotlang['Admin']['Payment']['Rejected'] = "⭕️ Платеж отклонен, пользователь уведомлен";

$textbotlang['Admin']['Usertest']['settimeusertest'] = "⏳ Срок тестового сервиса";
$textbotlang['Admin']['Usertest']['setvolumeusertest'] = "💾 Объем тестового аккаунта";
$textbotlang['Admin']['Usertest']['sendtimeusertest'] = "🕰 Введите срок тестового сервиса в часах.
Текущий срок: %s часов
⚠️ Указывается в часах.";
$textbotlang['Admin']['Usertest']['sendvoluemusertest'] = "Введите объем тестового сервиса в МБ.
Текущий объем: %s МБ
⚠️ Указывается в МБ.";
$textbotlang['Admin']['Usertest']['TimeUpdated'] = "✅ Срок тестового сервиса обновлен";
$textbotlang['Admin']['Usertest']['VolumeUpdated'] = "✅ Объем тестового сервиса обновлен";

$textbotlang['Admin']['Balance']['PriceBalance'] = "ID получен, введите сумму для зачисления (в томанах)";
$textbotlang['Admin']['Balance']['PriceBalancek'] = "ID получен, введите сумму для списания (в томанах)";
$textbotlang['Admin']['Balance']['Invalidprice'] = "Неверная сумма";
$textbotlang['Admin']['Balance']['AddBalanceUser'] = "✅ Средства зачислены пользователю";
$textbotlang['Admin']['Balance']['NegativeBalanceUser'] = "✅ Средства списаны у пользователя";
$textbotlang['Admin']['Balance']['addallbalance'] = "📌 Введите сумму для массового зачисления";
$textbotlang['Admin']['Balance']['maxpricebalance'] = "Максимум 100 млн томанов";
$textbotlang['Admin']['Balance']['AddedBalance'] = "💎 Уважаемый пользователь, на ваш счет зачислено %s томанов.";
$textbotlang['Admin']['Balance']['ReduceBalance'] = "❌ Уважаемый пользователь, с вашего счета списано %s томанов.";
$textbotlang['Admin']['Balance']['SendBalanceAll'] = "👥 Массовое зачисление";

$textbotlang['Admin']['Discount']['titlebtn'] ="🎁 Создать промокод";
$textbotlang['Admin']['Discount']['titlebtnremove'] ="❌ Удалить промокод";
$textbotlang['Admin']['Discount']['GetCode'] ="Введите код промокода";
$textbotlang['Admin']['Discount']['ErrorCode'] ="Неверный код, используйте только английские буквы без спецсимволов";
$textbotlang['Admin']['Discount']['PriceCode'] ="Код получен, теперь введите сумму промокода";
$textbotlang['Admin']['Discount']['SaveCode'] ="✅ Промокод успешно сохранен";
$textbotlang['Admin']['Discount']['RemoveCode'] ="Выберите промокод для удаления";
$textbotlang['Admin']['Discount']['RemovedCode'] ="✅ Промокод удален.";
$textbotlang['Admin']['Discount']['NotCode'] = "❌ Ошибка 
📝 Промокод не найден";

$textbotlang['Admin']['AlgortimeUsername']['SaveData'] = "✅Метод создания имен пользователей успешно обновлен";

$textbotlang['Admin']['SettingPayment']['Savacard'] = "✅ Номер карты успешно сохранен.";
$textbotlang['Admin']['SettingnowPayment']['Savaapi'] = "✅ Изменения успешно сохранены";

$textbotlang['Admin']['Discountsell']['create'] = "🎁 Создать промокод";
$textbotlang['Admin']['Discountsell']['remove'] = "❌ Удалить промокод";
$textbotlang['Admin']['Discountsell']['GetCode'] ="Введите код промокода";
$textbotlang['Admin']['Discountsell']['getlimit'] ="Введите лимит использований для пользователя";
$textbotlang['Admin']['Discount']['PriceCodesell'] ="Код получен, теперь введите процент скидки";
$textbotlang['Admin']['Discount']['invalidcodedis'] ="❌ Неверный промокод";
$textbotlang['Admin']['Discount']['Discountused'] = "❌ Этот промокод уже существует, используйте другой";
$textbotlang['Admin']['Discount']['typediscount'] = "📌 Промокод для первой покупки или всех покупок?
    0: Все покупки
    1: Только первая покупка";

$textbotlang['Admin']['mesage']['nottextmessage'] ="❌ В массовой рассылке разрешен только текст.";

$textbotlang['Admin']['keyboardadmin']['bot_statistics'] = "📊 Статистика бота";
$textbotlang['Admin']['keyboardadmin']['manage_panel'] = "✏️ Управление панелями";
$textbotlang['Admin']['keyboardadmin']['add_panel'] = "🖥 Добавить панель";
$textbotlang['Admin']['keyboardadmin']['test_account_settings'] = "🔑 Настройки тестовых аккаунтов";
$textbotlang['Admin']['keyboardadmin']['shop_section'] = "🏬 Раздел магазина";
$textbotlang['Admin']['keyboardadmin']['finance'] = "💵 Финансы";
$textbotlang['Admin']['keyboardadmin']['admin_section'] = "👨‍🔧 Раздел администратора";
$textbotlang['Admin']['keyboardadmin']['bot_text_settings'] = "📝 Настройки текста бота";
$textbotlang['Admin']['keyboardadmin']['user_services'] = "👤 Услуги пользователей";
$textbotlang['Admin']['keyboardadmin']['user_search'] = "👁‍🗨 Поиск пользователя";
$textbotlang['Admin']['keyboardadmin']['send_message'] = "📨 Отправить сообщение";
$textbotlang['Admin']['keyboardadmin']['affiliate_settings'] = "👥 Настройки реферальной программы";
$textbotlang['Admin']['keyboardadmin']['tutorial_section'] = "📚 Раздел обучения";
$textbotlang['Admin']['keyboardadmin']['settings'] = "⚙️ Настройки";
$textbotlang['Admin']['keyboardadmin']['settingscron'] = "🕚 Настройки cron jobs";
$textbotlang['Admin']['keyboardadmin']['seetingstatus'] = "⚙️ Статус функций";

$textbotlang['Admin']['affiliate']['status'] = "🎁 Статус реферальной программы";
$textbotlang['Admin']['affiliate']['Percentageset'] = "🧮 Настроить реферальный процент";
$textbotlang['Admin']['affiliate']['setbaner'] = "🏞 Настроить реферальный баннер";
$textbotlang['Admin']['affiliate']['porsantafterbuy'] = "🎁 Бонус за покупки рефералов";
$textbotlang['Admin']['affiliate']['gift'] = "🎁 Получить бонус";
$textbotlang['Admin']['affiliate']['giftstart'] = "🌟 Бонус за запуск бота";

$textbotlang['Admin']['cron']['test']['active'] = "Активировать cron теста";
$textbotlang['Admin']['cron']['test']['disable'] = "Деактивировать cron теста";
$textbotlang['Admin']['cron']['test']['disabled'] = "Cron job деактивирован";
$textbotlang['Admin']['cron']['test']['dec'] = "✅ Cron job активирован, будет выполняться каждые 15 минут";
$textbotlang['Admin']['cron']['volume']['active'] = "Активировать cron трафика";
$textbotlang['Admin']['cron']['volume']['disable'] = "Деактивировать cron трафика";
$textbotlang['Admin']['cron']['volume']['dec'] = "✅ Cron job активирован, будет выполняться каждую минуту";
$textbotlang['Admin']['cron']['time']['active'] = "Активировать cron времени";
$textbotlang['Admin']['cron']['time']['disable'] = "Деактивировать cron времени";
$textbotlang['Admin']['cron']['time']['dec'] = "✅ Cron job активирован, будет выполняться каждую минуту";
$textbotlang['Admin']['cron']['remove']['active'] = "Активировать cron удаления";
$textbotlang['Admin']['cron']['remove']['disable'] = "Деактивировать cron удаления";
$textbotlang['Admin']['cron']['remove']['dec'] = "✅ Cron job активирован, будет выполняться каждую минуту";
$textbotlang['Admin']['cron']['remove']['timeset'] = "Время удаления аккаунтов";
$textbotlang['Admin']['cron']['remove']['dectime'] = "Введите количество дней после истечения срока, когда аккаунты будут удаляться.
Примечание: Этот раздел удаляет сервисы, у которых истек срок более X дней назад.
Указывается в днях";
$textbotlang['Admin']['cron']['remove']['invalidtime'] = "Неверное время";
$textbotlang['Admin']['cron']['remove']['timeseted'] = "Время успешно установлено";

$textbotlang['Admin']['Automatic_confirmation']['title'] = "🤖 Автоподтверждение без проверки";

$textbotlang['Admin']['category']['status'] = "🕹 Категории";
$textbotlang['Admin']['category']['add'] = "🛒 Добавить категорию";
$textbotlang['Admin']['category']['remove'] = "❌ Удалить категорию";
$textbotlang['Admin']['category']['getname'] = "📌 Введите название новой категории.";
$textbotlang['Admin']['category']['addedcategry'] = "✅ Категория успешно добавлена.";
$textbotlang['Admin']['category']['getcatgory'] = "📌 Выберите категорию для удаления";
$textbotlang['Admin']['category']['removedcategory'] = "✅ Категория успешно удалена.";
$textbotlang['Admin']['category']['added'] = "📌 Выберите категорию для удаления";

$textbotlang['Admin']['Report']['extend'] = "⭕️ Пользователь продлил сервис.
            
Информация о пользователе: 
            
🪪 ID: <code>%s</code>
🪪 Имя пользователя: @%s
🛍 Название продукта:  %s
💰 Сумма продления %s томанов
👤 Имя пользователя: %s
Баланс пользователя:  %s томанов
Локация сервиса:  %s";
$textbotlang['Admin']['Report']['Extra_volume'] = "⭕️ Пользователь купил дополнительный трафик
Информация: 
🪪 ID: %s
🛍 Объем: %s
💰 Сумма: %s томанов";
$textbotlang['Admin']['Report']['NotifRemoveByUser'] = "Администратор, пользователь удалил свой сервис после окончания трафика или срока
Имя пользователя конфига: %s";
$textbotlang['Admin']['Report']['ReportTestCreate'] = "📣 Детали создания тестового аккаунта зарегистрированы.

▫️ID пользователя: %s
▫️Имя пользователя: @%s
▫️Имя пользователя конфига: %s
▫️Имя пользователя: %s
▫️Локация сервиса: %s
▫️Номер телефона: %s";
$textbotlang['Admin']['Report']['acceptcartresid'] = "📣 Администратор подтвердил платеж по карте.
Детали:
👤ID администратора: %s
💰 Сумма: %s";
$textbotlang['Admin']['Report']['reportremove'] = "⭕️ Администратор одобрил запрос пользователя на удаление сервиса
            
Информация об администраторе: 
            
🪪 ID: <code>%s</code>
💰 Сумма возврата: %s томанов
👤 Имя пользователя: %s
ID запросившего удаление: %s";
$textbotlang['Admin']['Report']['reportremovecron'] = "❌ Сервис с именем пользователя %s удален
            Причина: %s ";
$textbotlang['Admin']['Report']['aqayepardakht'] = "💵 Новый платеж
        
ID пользователя: %s
Сумма %s
Метод: Шлюз Господина Платежа";
$textbotlang['Admin']['Report']['nowpayment'] = "💵 Новый платеж
        
ID пользователя: %s
Сумма %s
Метод: nowpayment";
$textbotlang['Admin']['Report']['autocart'] = "💵 Новый платеж
        
ID пользователя: %s
Сумма %s
Метод: Автоподтверждение без проверки";
$textbotlang['users']['Report']['discountused'] = "⭕️ Пользователь @%s с ID %s использовал промокод %s.";
$textbotlang['users']['Report']['reportbuy'] = " 🛍 Новая покупка
            
⚙️ Пользователь купил аккаунт с именем <code>%s</code>
    
Цена: %s томанов
Объем: %s
ID пользователя: <code>%s</code>
Номер телефона: %s
Локация сервиса: %s
Баланс пользователя: %s томанов
    
Информация о пользователе 👇👇
⚜️ Имя пользователя: @%s";
$textbotlang['users']['Report']['reportbuyafterpay'] = " 🛍 Новая покупка после успешной оплаты
            
⚙️ Пользователь купил аккаунт с именем <code>%s</code>
    
Цена: %s томанов
Объем: %s
ID пользователя: <code>%s</code>
Номер телефона: %s
Локация сервиса: %s
Баланс пользователя: %s томанов
    
Информация о пользователе 👇👇
⚜️ Имя пользователя: @%s";
$textbotlang['users']['Report']['reportpayiranpay'] = "💵 Новый платеж
            
ID пользователя: %s
Сумма: %s
Метод: Валютный шлюз";
$textbotlang['users']['Report']['discountuser'] = "Промокод %s использован
            
Информация о пользователе: 
            
🪪 ID: <code>%s</code>
🪪 Имя пользователя: @%s
💰 Сумма бонуса %s томанов";
